eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
#include <WiFi.h>
#include <ESPmDNS.h>
#include <WiFiUdp.h>
#include <ArduinoOTA.h>
#include <ESP32Servo.h>
// #include <EEPROM.h>
#include "soc/soc.h"
#include "soc/rtc_cntl_reg.h"
#include <WiFiManager.h> // https://github.com/tzapu/WiFiManager
#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <HardwareSerial.h>
#include <Preferences.h>
#include "bongoCat.h"
// NTP Client
#include <NTPClient.h>
#include <WebSocketsClient.h>
#include <ArduinoJson.h>


Preferences preferences;

// NTP Settings
/** @brief UDP client for NTP communication. */
WiFiUDP ntpUDP;
/** @brief NTP client instance for time synchronization. */
NTPClient timeClient(ntpUDP);
/** @brief Timestamp of the last successful NTP update. */
unsigned long lastNTPUpdateTime = 0;
/** @brief Interval in milliseconds for updating time via NTP. */
long ntpUpdateInterval = 60 * 60 * 1000; // Update every hour
/** @brief Timezone POSIX string for DST handling. */
String timeZonePosixString = "UTC0"; // Default to UTC0
/** @brief Flag indicating if random servo motion is currently manually activated. */
bool randomMotionActive = false; // Toggled by the web button
/** @brief Flag indicating if an active scheduled movement has been temporarily overridden (e.g., by manual stop). */
bool scheduledMovementOverridden = false; // To temporarily stop scheduled movement
/** @brief Flag indicating if a scheduled movement is currently active based on NTP time and configured slots. */
bool isScheduledMovementActive = false; // Tracks if the schedule is currently active
/** @brief Flag indicating if the device is currently in a configuration mode (e.g., being adjusted via old HTTP interface, less relevant with WebSocket). */
bool inConfiguration = false; // Flag to indicate if in configuration mode
/** @brief String storing the start time of the currently active or next scheduled movement. */
String currentScheduleStartTime = "";
/** @brief String storing the stop time of the currently active or next scheduled movement. */
String currentScheduleStopTime = "";

// Define the serial port to use (adjust if needed)
/** @brief HardwareSerial instance used for communication with the ESP32CAM. */
HardwareSerial& serialPort = Serial2; // Use Serial2 (RX2, TX2)

/** @brief Flag indicating if WiFi was connected via WiFiManager's Access Point mode. */
bool wifiConnectedAP = false;
/** @brief SSID of the currently connected Wi-Fi network. */
String staSSID;
/** @brief Password for the currently connected Wi-Fi network. */
String staPassword;
/** @brief IP address of the connected ESP32CAM, received over serial. */
String esp32CamIP = "";
/** @brief Flag indicating if communication with the ESP32CAM has been established. */
bool esp32CamConnected = false;
/** @brief Flag indicating if the ESP32CAM is currently streaming video. */
bool streaming = false;
/** @brief Tracks the state of the CAM LED. */
bool camLedActive = false;


#define SCREEN_WIDTH 128
#define SCREEN_HEIGHT 32
#define OLED_RESET     -1
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);



Servo myservoX;
Servo myservoY;

const int servoPinX = 13;
const int servoPinY = 12;
const int outputPin = 25;
const int relayPin = 26;
const int touchPin1 = 32;
const int touchPin2 = 33; // New touch pin
// Define I2C pins
const int SDA_PIN = 21;
const int SCL_PIN = 18;

const int threshold = 75;  // Touch sensitivity threshold
int touchValue;
bool laserActive = true;  // Default ON
bool relayActive = true;  // Default ON
bool settingsMode = false;      // Declare globally
int currentSetting = 0;         // Declare globally

// Function to handle random motion
unsigned long lastMotionTime = 0;
unsigned long minMotionInterval = 100; // Minimum interval in milliseconds
unsigned long maxMotionInterval = 3000; // Maximum interval in milliseconds

struct TimeSlot {
  int startTimeMinutes; // Minutes from the start of the day (0-1439)
  int stopTimeMinutes;  // Minutes from the start of the day (0-1439)
  bool active;          // Flag to indicate if this timeslot is currently active
};

const int MAX_TIMERS = 5; // Define a maximum number of timers we can store
TimeSlot timeSlots[MAX_TIMERS];
int numTimeSlots;

WiFiManager wm;

String header;
String valueStringX = String(90);
String valueStringY = String(90);
int pos1 = 0;
int pos2 = 0;

unsigned long currentTime = millis();
unsigned long previousTime = 0;
const long timeoutTime = 2000;

int minX = 0, maxX = 180, minY = 45, maxY = 135;

// Variables for random velocity
int minVel = 800, maxVel = 2000; // Min and max delay times between movements - initialized
unsigned long lastMovementTime = 0;
unsigned long movementInterval = 1000;  // Default to 1 second between movements - initialized

// Movement tracking
/** @brief Structure to manage smooth servo movement. */
struct ServoMovement {
  /** @brief Starting position of the servo for the current movement. */
  int startPos;
  int targetPos;
  unsigned long startTime;
  unsigned long duration;
  /** @brief Flag indicating if the servo is currently executing a movement. */
  bool isMoving;
};

/** @brief Tracks the current movement state for servo X. */
ServoMovement movementX = {0, 0, 0, 0, false}; // Servo X movement tracking
/** @brief Tracks the current movement state for servo Y. */
ServoMovement movementY = {0, 0, 0, 0, false}; // Servo Y movement tracking

// WebSocket Global Variables
/** @brief Instance of the WebSocket client used for communication with the server. */
WebSocketsClient webSocket;
/** @brief Flag indicating the current connection status of the WebSocket. True if connected, false otherwise. */
bool webSocketConnected = false;
/** @brief Timestamp of the last attempt to reconnect the WebSocket. Used to manage reconnection intervals. */
unsigned long webSocketLastReconnectAttempt = 0;
/** @brief Interval in milliseconds between WebSocket reconnection attempts. */
const unsigned long webSocketReconnectInterval = 5000; // Try to reconnect every 5 seconds
/** @brief Unique identifier for this ESP32 device, typically derived from its MAC address. */
String deviceId = ""; // Will be set to ESP32 Chip ID
// Define WebSocket server details
/** @brief Hostname or IP address of the WebSocket server. */
const char* wsHost = "ebski.co";
/** @brief Port number for the WebSocket server. WebSocket Secure (WSS) port. */
const uint16_t wsPort = 80;
/** @brief Path for the WebSocket endpoint on the server. (e.g., wss://ebski.co/ws) */
const char* wsPath = "/ws";

