eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
    // Initialize servo positions
  myservoX.attach(servoPinX);
  myservoY.attach(servoPinY);
  myservoX.write(initialX);
  myservoY.write(initialY);
  
    // Set initial slider values
  valueStringX = String(initialX);
  valueStringY = String(initialY);

  // wm.resetSettings(); // Reset WiFi settings
  wm.setAPCallback(configModeCallback);
  if (!wm.autoConnect("MiauAP")) {
    Serial.println("Failed to connect to WiFi");
    // displayConnectAPMessage(); // Display message on OLED
  } else {
    Serial.println("Connected to WiFi");
    wm.setShowPassword(true);
    // wm.setSaveConfigCallback(saveWifiCallback);
    wifiConnectedAP = true;
    staSSID = WiFi.SSID();
    staPassword = WiFi.psk();
    Serial.println(staSSID);
    Serial.println(staPassword);

    // Configure time using POSIX string for proper DST handling
    // The first two arguments (GMToffset and DSToffset) are 0 when a POSIX string is used,
    // as the POSIX string itself defines these.
    configTime(0, 0, "pool.ntp.org", timeZonePosixString.c_str());
    Serial.printf("Time configured with POSIX string: %s\n", timeZonePosixString.c_str());

    // Initialize NTP Client - after configTime, setTimeOffset for NTPClient should be 0
    // as POSIX string handles the actual offset and DST.
    timeClient.begin();
    timeClient.setTimeOffset(0); // POSIX string handles the actual offset
    // timeClient.setDayLight(false); // Not strictly needed as POSIX string handles DST rules.
                                   // Some versions of NTPClient might not have setDayLight.
                                   // If it causes issues or is unavailable, it can be omitted.
    Serial.println("NTP Client started (after POSIX configTime).");

    // Immediately try to get the time at startup
    if (!timeClient.update()) {
      Serial.println("Failed to get NTP time at startup.");
    } else {
      Serial.println("NTP time synchronized at startup.");
    }
    lastNTPUpdateTime = millis(); // Initialize the last update time
  }



  // OTA setup
  ArduinoOTA.onStart([]() {
    Serial.println("Start OTA update");
  }).onEnd([]() {
    Serial.println("OTA update complete");
  }).onError([](ota_error_t error) {
    Serial.printf("OTA Error[%u]\n", error);
  });
  ArduinoOTA.begin();

  // Set custom headers. Each header must end with \r\n.
  // Adding Origin header, which might be required/expected by the WebSocket server or proxy (Nginx/Ratchet)
  // for a successful handshake, especially for proxied connections.
  // webSocket.setExtraHeaders("Origin: https://www.ebski.co\r\n");

  // Ensure all custom header manipulations are commented out for this test
  // to use library defaults.
  // webSocket.setExtraHeaders("User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/90.0.4430.93 Safari/537.36 ESP32WebSocketClient\r\n");

  // const char* subprotocols[] = {}; // THIS LINE SHOULD BE REMOVED/COMMENTED
  // webSocket.setSubprotocols(subprotocols, 0); // THIS LINE SHOULD BE REMOVED/COMMENTED

  // Set a browser-like User-Agent.
  // The library will send its default Sec-WebSocket-Protocol: arduino.
  // webSocket.setUserAgent("Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/90.0.4430.93 Safari/537.36 ESP32WebSocketClient");

  // Connect to WSS (WebSocket Secure) server.
  // For production systems with public CAs (like Let's Encrypt), this should work.
  // If connection issues occur with SSL, you might need to provide a root CA certificate
  // or a fingerprint, e.g., webSocket.beginSSL(wsHost, wsPort, wsPath, "/path_to_ca_cert_on_fs", "fingerprint");
  // However, for many common CAs, the ESP32's underlying stack may handle it.
  webSocket.begin(wsHost, wsPort, wsPath);
  webSocket.onEvent(webSocketEvent);
  webSocket.setReconnectInterval(5000); // Already set via const but can be set here too
  // Optional: for SSL, if your server uses a self-signed cert or you want to pin.
  // webSocket.setFingerprint("...");

  preferences.end(); // End preferences access after all setup loading/initial saving.

    // IMPORTANT: WebSocket Receive Buffer Size for addTimer command
    // The "addTimer" command payload is being truncated, likely due to the default
    // WebSocket client receive buffer size being too small (observed truncation at ~22 bytes).
    // To fix this, you may need to modify a configuration constant within the WebSocket library files.
    //
    // 1. Locate your WebSocket library files:
    //    Typically found in your Arduino libraries folder, under a name like "WebSockets" or "WebSocketsClient".
    //    For this project, it's likely under `lib/WebSockets/src/`.
    //
    // 2. Search for buffer size constants in files like `WebSocketsClient.h`, `WebSockets.h`,
    //    or a specific `WebSocketsOptions.h` or `WebSocketsConfig.h` if it exists.
    //
    // 3. Look for constants such as:
    //    - `WEBSOCKETS_CLIENT_RX_BUFFER_SIZE` (if available, this is the most direct)
    //    - `WEBSOCKETS_TCP_BUFFER_SIZE`
    //    - `TCP_WND` (TCP Window size, sometimes influences this for some libraries)
    //    - `WEBSOCKETS_MAX_FRAME_SIZE` (less likely for RX of small messages, but related)
    //    - Any other obvious buffer size or "max packet" related constant.
    //
    // 4. Increase the value of this constant.
    //    - Default might be small (e.g., 64, 128, or related to TCP MSS ~536).
    //    - Try increasing it to at least 256, or preferably 512 or 1024, to accommodate
    //      JSON commands comfortably. For example:
    //      `#define WEBSOCKETS_CLIENT_RX_BUFFER_SIZE 512`
    //
    // 5. Recompile and upload the firmware.
    //
    // If a specific method like `webSocket.setRxBufferSize(size)` were available, it would be called here.
    // However, this is not standard for the commonly used ESP32 WebSocketsClient library by Markus Sattler.
    // Serial.println("[INFO] Check WebSocket library for RX buffer size if 'addTimer' fails due to truncated payload.");
}

/**
 * @brief Sends the current system configuration (servo limits, timers) to the WebSocket client.
 *
 * Constructs a JSON message containing the type "systemConfig", the current values of
 * minX, maxX, minY, maxY, and an array of all configured timers. Each timer object
 * in the array includes its startTimeMinutes and stopTimeMinutes.
 * This message is then sent to the connected WebSocket client.
 */
void sendSystemConfig() {
    if (!webSocketConnected) {
        Serial.println("[sendSystemConfig] WebSocket not connected. Cannot send config.");
        return;
    }

