eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
    StaticJsonDocument<768> doc; // Existing size, should be okay for one more field

    // Add deviceId to the message at the top level
    doc["type"] = "systemConfig";
    doc["deviceId"] = deviceId; // <--- ENSURE THIS LINE IS PRESENT AND CORRECT

    // Nest the actual configuration data under a 'config' key
    JsonObject config_obj = doc.createNestedObject("config");
    config_obj["min_x"] = minX; // Use snake_case
    config_obj["max_x"] = maxX; // Use snake_case
    config_obj["min_y"] = minY; // Use snake_case
    config_obj["max_y"] = maxY; // Use snake_case

    config_obj["min_vel"] = minVel;
    config_obj["max_vel"] = maxVel;
    // config_obj["timezone"] = timeZoneOffset; // Old integer offset - REMOVED
    config_obj["timezone_posix"] = timeZonePosixString; // Send POSIX string
    config_obj["ntp_interval"] = ntpUpdateInterval; // Already a long (ms)
    // config_obj["cam_led_active"] = camLedActive;

    JsonArray timersArray = config_obj.createNestedArray("timers");
    for (int i = 0; i < numTimeSlots; i++) {
        if (timeSlots[i].startTimeMinutes != -1 && timeSlots[i].stopTimeMinutes != -1) {
            JsonObject timer = timersArray.createNestedObject();
            timer["startTimeMinutes"] = timeSlots[i].startTimeMinutes;
            timer["stopTimeMinutes"] = timeSlots[i].stopTimeMinutes;
        }
    }

    String output;
    serializeJson(doc, output);

    // Existing debug logs
    Serial.println("[DEBUG] Attempting to send systemConfig via WebSocket.");
    Serial.println("JSON to send: " + output);

    bool sent = webSocket.sendTXT(output);
    if (sent) {
        Serial.println("[DEBUG] systemConfig message sent successfully to WebSocket server.");
    } else {
        Serial.println("[ERROR] Failed to send systemConfig message to WebSocket server!");
    }
}

void saveTimersToPreferences() {
  preferences.begin("servo_config", false); // false for read/write

  // Store the current numTimeSlots that we are about to save.
  // This is the count of *active* timers.
  int activeTimeSlotsCount = numTimeSlots;

  preferences.putInt("num_timers", activeTimeSlotsCount);
  Serial.printf("[DEBUG] saveTimers: Saving num_timers (active count): %d\n", activeTimeSlotsCount);

  // Save only the active timers based on the current state of the timeSlots array
  for (int i = 0; i < activeTimeSlotsCount; i++) {
    String startKey = "timer_" + String(i) + "_start";
    String stopKey = "timer_" + String(i) + "_stop";

    // Ensure we are saving valid data from the timeSlots array for the active slots
    if (timeSlots[i].startTimeMinutes != -1 && timeSlots[i].stopTimeMinutes != -1 && timeSlots[i].startTimeMinutes != timeSlots[i].stopTimeMinutes) {
        preferences.putInt(startKey.c_str(), timeSlots[i].startTimeMinutes);
        preferences.putInt(stopKey.c_str(), timeSlots[i].stopTimeMinutes);
        Serial.printf("[DEBUG] saveTimers: Saved Timer %d to Prefs: Start=%d, Stop=%d\n", i, timeSlots[i].startTimeMinutes, timeSlots[i].stopTimeMinutes);
    } else {
        // This case means an invalid timer exists within the active range.
        // This should ideally be prevented by addTimeSlot and loading logic.
        // If found, remove its keys to clean up.
        Serial.printf("[DEBUG] saveTimers: Timer %d in active range (0 to %d-1) was invalid (Start:%d, Stop:%d). Removing its keys from Prefs.\n", i, activeTimeSlotsCount, timeSlots[i].startTimeMinutes, timeSlots[i].stopTimeMinutes);
        if (preferences.isKey(startKey.c_str())) {
            preferences.remove(startKey.c_str());
        }
        if (preferences.isKey(stopKey.c_str())) {
            preferences.remove(stopKey.c_str());
        }
    }
  }

  // Explicitly remove keys for any timer slots beyond the new activeTimeSlotsCount, up to MAX_TIMERS.
  // This cleans up stale data in NVS if numTimeSlots has decreased (e.g., after a deletion).
  for (int i = activeTimeSlotsCount; i < MAX_TIMERS; i++) {
    String startKey = "timer_" + String(i) + "_start";
    String stopKey = "timer_" + String(i) + "_stop";

    if (preferences.isKey(startKey.c_str())) {
        preferences.remove(startKey.c_str());
        Serial.printf("[DEBUG] saveTimers: Removed stale key %s from Prefs for slot %d.\n", startKey.c_str(), i);
    }
    if (preferences.isKey(stopKey.c_str())) {
        preferences.remove(stopKey.c_str());
        Serial.printf("[DEBUG] saveTimers: Removed stale key %s from Prefs for slot %d.\n", stopKey.c_str(), i);
    }
  }

  preferences.end(); // This should commit all changes (puts and removes)
  Serial.println("[DEBUG] Timers saved to Preferences (with cleanup of stale slots).");
}

void addTimeSlot(String startTimeStr, String stopTimeStr) {
  Serial.printf("[DEBUG] addTimeSlot called with startTimeStr: %s, stopTimeStr: %s\n", startTimeStr.c_str(), stopTimeStr.c_str());
  if (numTimeSlots < MAX_TIMERS) {
    int startTimeMinutes = timeToMinutes(startTimeStr);
    int stopTimeMinutes = timeToMinutes(stopTimeStr);
    Serial.printf("[DEBUG] Converted to startTimeMinutes: %d, stopTimeMinutes: %d\n", startTimeMinutes, stopTimeMinutes);

    // Enhanced validation for converted minutes, including zero-duration check
    if (startTimeMinutes == -1 || stopTimeMinutes == -1 || startTimeMinutes == stopTimeMinutes) {
        Serial.printf("[DEBUG] Invalid input or zero-duration timer provided to addTimeSlot (StartMins: %d, StopMins: %d). Timer not added.\n", startTimeMinutes, stopTimeMinutes);
        return; // Exit if invalid or zero-duration
    }

    timeSlots[numTimeSlots].startTimeMinutes = startTimeMinutes;
    timeSlots[numTimeSlots].stopTimeMinutes = stopTimeMinutes;
    timeSlots[numTimeSlots].active = false; // Ensure new timers are initially inactive
    numTimeSlots++; // Increment numTimeSlots FIRST
    Serial.printf("[DEBUG] numTimeSlots incremented to: %d\n", numTimeSlots);
    Serial.println("[DEBUG] About to save timers in addTimeSlot.");
    saveTimersToPreferences(); // Now save with the updated count
    Serial.printf("Added new timeslot. Total slots: %d. Start: %s, End: %s\n", numTimeSlots, startTimeStr.c_str(), stopTimeStr.c_str());
  } else {
    Serial.println("Maximum number of timers reached. Cannot add new slot.");
  }
}

void deleteTimeSlot(int indexToDelete) {
  if (indexToDelete >= 0 && indexToDelete < numTimeSlots) {
    // Shift the remaining timers to fill the gap
    for (int i = indexToDelete; i < numTimeSlots - 1; i++) {
      timeSlots[i] = timeSlots[i + 1];
    }
    // Mark the last slot as empty
    timeSlots[numTimeSlots - 1].startTimeMinutes = -1;
    timeSlots[numTimeSlots - 1].stopTimeMinutes = -1;
    numTimeSlots--;
    saveTimersToPreferences();
  } else {
    Serial.println("Invalid timer index to delete.");
  }
}



void updateDisplay() {
  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);
  display.setCursor(0, 0);

  if (WiFi.status() == WL_CONNECTED) {
    display.print("IP: ");
    display.println(WiFi.localIP());
    display.print("Time: ");
    display.println(timeClient.getFormattedTime());
    display.setCursor(0, 16); // Move to the second half of the screen

